content/posts/Evolution_and_Selection_of_Quantitative_Traits_by_Bruce_Walsh_and_Michael_Lynch_in_2018.md
+++
title = "Evolution and Selection of Quantitative Traits by Bruce Walsh and Michael Lynch in 2018"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:22-04:00
slug = "Evolution_and_Selection_of_Quantitative_Traits_by_Bruce_Walsh_and_Michael_Lynch_in_2018"
draft = false
+++

## citation {#citation}


### Walsh, B., & Lynch, M. (2018). Evolution and Selection of Quantitative Traits. Oxford University Press. {#walsh-b-dot-and-lynch-m-dot--2018--dot-evolution-and-selection-of-quantitative-traits-dot-oxford-university-press-dot}


## contents {#contents}


### I. Introduction {#i-dot-introduction}

<!--list-separator-->

-  1. Changes in quantitative traits over time


### II. Evolution at one and two loci {#ii-dot-evolution-at-one-and-two-loci}

<!--list-separator-->

-  2. Neutral evolution in one\* and two-locus systems

<!--list-separator-->

-  3. The genetic effective size of a population

<!--list-separator-->

-  4. The nonadaptive forces of evolution

<!--list-separator-->

-  5. The population genetics of selection

<!--list-separator-->

-  6. Theorems of natural selection: results of Price, Fisher, and Robertson

<!--list-separator-->

-  7. Interaction of selection, mutation, and drift

<!--list-separator-->

-  8. Hitchhiking and selective sweeps

<!--list-separator-->

-  9. Using molecular data to detect selection: signatures from recent single events

<!--list-separator-->

-  10. Using molecular data to detect selection: signatures from multiple historical events


### III. Drift and quantitative traits {#iii-dot-drift-and-quantitative-traits}

<!--list-separator-->

-  11. Changes in genetic variance induced by drift

<!--list-separator-->

-  12. The neutral divergence of quantitative traits


### IV. Short-term response on a single character {#iv-dot-short-term-response-on-a-single-character}

<!--list-separator-->

-  13. Short-term changes in the mean: 1. The Breeder's equation

<!--list-separator-->

-  14. Short-term changes in the mean: 2. Truncation and threshold selection

<!--list-separator-->

-  15. Short-term changes in the mean: 3. Permanent versus transient response

<!--list-separator-->

-  16. Short-term changes in the variance: 1. Changes in the additive variance

<!--list-separator-->

-  17. Short-term changes in the variance: 2. Changes in the environmental variance

<!--list-separator-->

-  18. Analysis of short-term selection experiments: 1. Least-squares approaches

<!--list-separator-->

-  19. Analysis of short-term selection experiments: 2. Mixed-model and Bayesian approaches

<!--list-separator-->

-  20. Selection response in natural populations


### V. Selection in structured populations {#v-dot-selection-in-structured-populations}

<!--list-separator-->

-  21. Family-based selection

<!--list-separator-->

-  22. Associative effects: competition, social interactions, group and kin selection

<!--list-separator-->

-  23. Selection under inbreeding


### VI. Population-genetic models of trait response {#vi-dot-population-genetic-models-of-trait-response}

<!--list-separator-->

-  24. The infinitesimal model and its extensions

<!--list-separator-->

-  25. Long-term response: 1. Deterministic aspects

<!--list-separator-->

-  26. Long-term response: 2. Finite population size and mutation

<!--list-separator-->

-  27. Long-term response: 3. Adaptive walks

<!--list-separator-->

-  28. Maintenance of quantitative genetic variation


### VII. Measuring selection on traits {#vii-dot-measuring-selection-on-traits}

<!--list-separator-->

-  29. Individual fitness and the measurement of univariate selection

<!--list-separator-->

-  30. Measuring multivariate selection


### VIII. Appendix {#viii-dot-appendix}

<!--list-separator-->

-  A1. Diffusion theory

<!--list-separator-->

-  A2. Introduction to Bayesian analysis

<!--list-separator-->

-  A3. Markov chain Monte Carlo and Gibbs sampling

<!--list-separator-->

-  A4. Multiple comparisons: Bonferroni corrections, False-Discovery rates, and Meta-analysis

<!--list-separator-->

-  A5. The geometry of vectors and matrices: eigenvalues and eigenvectors

<!--list-separator-->

-  A6. Derivatives of vectors and vector-valued functions
